A DataFrame 
+ represents a rectangular table of data 
+ contains an ordered collection of columns, each of which can be a different value type (numeric, string, boolean)

Hierarchical indexing allows for higher dimensional data than 2-D, even though tables are 2-D

In [2]:
data = {
    'state': ['Ohio', 'Ohio', 'Florida', 'Florida'],
    'year': [2000, 2001, 2000, 2001],
    'pop': [1.5, 1.7, 3.6, 2.4]
}

In [3]:
import pandas as pd

frame = pd.DataFrame(data)

In [4]:
frame

   pop    state  year
0  1.5     Ohio  2000
1  1.7     Ohio  2001
2  3.6  Florida  2000
3  2.4  Florida  2001

So pd.DataFrame --> treats dict of arrays --> keys are column names, arrays go according to index

In [5]:
frame.head(2)

   pop state  year
0  1.5  Ohio  2000
1  1.7  Ohio  2001

In [6]:
frame2 = pd.DataFrame(data, columns=['state', 'year', 'pop'])

In [7]:
frame2

     state  year  pop
0     Ohio  2000  1.5
1     Ohio  2001  1.7
2  Florida  2000  3.6
3  Florida  2001  2.4

In [8]:
frame3 = pd.DataFrame(data, columns=['state', 'year', 'pop', 'owls'])

In [9]:
frame3

     state  year  pop owls
0     Ohio  2000  1.5  NaN
1     Ohio  2001  1.7  NaN
2  Florida  2000  3.6  NaN
3  Florida  2001  2.4  NaN

In [10]:
frame3['state']

0       Ohio
1       Ohio
2    Florida
3    Florida
Name: state, dtype: object

In [11]:
frame3.year

0    2000
1    2001
2    2000
3    2001
Name: year, dtype: int64

In [14]:
frame3.loc[3]

state    Florida
year        2001
pop          2.4
owls         NaN
Name: 3, dtype: object

In [15]:
frame3['owls'] = "BOOM"

In [16]:
frame3

     state  year  pop  owls
0     Ohio  2000  1.5  BOOM
1     Ohio  2001  1.7  BOOM
2  Florida  2000  3.6  BOOM
3  Florida  2001  2.4  BOOM

In [20]:
frame3['owls'] = range(1000, 1004)

In [21]:
frame3

     state  year  pop  owls
0     Ohio  2000  1.5  1000
1     Ohio  2001  1.7  1001
2  Florida  2000  3.6  1002
3  Florida  2001  2.4  1003

In [25]:
import numpy as np

frame3['owls'] = np.arange(4.)

In [26]:
frame3

     state  year  pop  owls
0     Ohio  2000  1.5   0.0
1     Ohio  2001  1.7   1.0
2  Florida  2000  3.6   2.0
3  Florida  2001  2.4   3.0

When you are assigning lists or arrays to a column, the value's length must match the length of the DataFrame.

In [27]:
del frame3['owls']

In [28]:
frame3

     state  year  pop
0     Ohio  2000  1.5
1     Ohio  2001  1.7
2  Florida  2000  3.6
3  Florida  2001  2.4